paddy2008/c51_uboot/inc/Efm8lb12_qsfp28.h
#ifndef __100g_sfp_EFM8LB1_qsfp28_h__
#define __100g_sfp_EFM8LB1_qsfp28_h__

#include <SI_EFM8LB1_Register_Enums.h>

/******Select Page Macro Define*****/
#define SFP_PAGE_SELECT		(0x7F)

/*****Scale For Temp Calculations*****/
#define DDMI_CALI_TEMP_SCALE	(0x100)

#define MAX_CHANNEL_NUMS        (0x4)


/********************************************Lower Page Addr Mapping Tab******************************/
#define MSA_BOOT_STATUS		(0x2)
#define MSA_TX_ENABLE		(86)

/********************************************MSA Page2 Addr Mapping Tab*******************************/
#define SFP_DEBUG_LOG_START_ADDR  (0x80)

/********************************************MSA Page3 Addr Mapping Tab*******************************/

#define PAGE3_TEMP_HIGH_ALARM_MSB         (0x80)
#define PAGE3_TEMP_HIGH_ALARM_LSB         (0x81)
#define PAGE3_TEMP_LOW_ALARM_MSB          (0x82)
#define PAGE3_TEMP_LOW_ALARM_LSB          (0x83)
#define PAGE3_TEMP_HIGH_WARN_MSB          (0x84)
#define PAGE3_TEMP_HIGH_WARN_LSB          (0x85)
#define PAGE3_TEMP_LOW_WARN_MSB           (0x86)
#define PAGE3_TEMP_LOW_WARN_LSB           (0x87)

#define PAGE3_VCC_HIGH_ALARM_MSB          (0x90)
#define PAGE3_VCC_HIGH_ALARM_LSB          (0x91)
#define PAGE3_VCC_LOW_ALARM_MSB           (0x92)
#define PAGE3_VCC_LOW_ALARM_LSB           (0x93)
#define PAGE3_VCC_HIGH_WARN_MSB           (0x94)
#define PAGE3_VCC_HIGH_WARN_LSB           (0x95)
#define PAGE3_VCC_LOW_WARN_MSB            (0x96)
#define PAGE3_VCC_LOW_WARN_LSB            (0x97)

#define PAGE3_RXPWR_HIGH_ALARM_MSB        (0xB0)
#define PAGE3_RXPWR_HIGH_ALARM_LSB        (0xB1)
#define PAGE3_RXPWR_LOW_ALARM_MSB         (0xB2)
#define PAGE3_RXPWR_LOW_ALARM_LSB         (0xB3)
#define PAGE3_RXPWR_HIGH_WARN_MSB         (0xB4)
#define PAGE3_RXPWR_HIGH_WARN_LSB         (0xB5)
#define PAGE3_RXPWR_LOW_WARN_MSB          (0xB6)
#define PAGE3_RXPWR_LOW_WARN_LSB          (0xB7)

#define PAGE3_TXBIAS_HIGH_ALARM_MSB       (0xB8)
#define PAGE3_TXBIAS_HIGH_ALARM_LSB       (0xB9)
#define PAGE3_TXBIAS_LOW_ALARM_MSB        (0xBA)
#define PAGE3_TXBIAS_LOW_ALARM_LSB        (0xBB)
#define PAGE3_TXBIAS_HIGH_WARN_MSB        (0xBC)
#define PAGE3_TXBIAS_HIGH_WARN_LSB        (0xBD)
#define PAGE3_TXBIAS_LOW_WARN_MSB         (0xBE)
#define PAGE3_TXBIAS_LOW_WARN_LSB         (0xBF)

#define PAGE3_TXPWR_HIGH_ALARM_MSB        (0xC0)
#define PAGE3_TXPWR_HIGH_ALARM_LSB        (0xC1)
#define PAGE3_TXPWR_LOW_ALARM_MSB         (0xC2)
#define PAGE3_TXPWR_LOW_ALARM_LSB         (0xC3)
#define PAGE3_TXPWR_HIGH_WARN_MSB         (0xC4)
#define PAGE3_TXPWR_HIGH_WARN_LSB         (0xC5)
#define PAGE3_TXPWR_LOW_WARN_MSB          (0xC6)
#define PAGE3_TXPWR_LOW_WARN_LSB          (0xC7)

/********************************************MSA Page4 Addr Mapping Tab*******************************/

#define SFP_DDMI_TEMP_MSB					(0x80)
#define SFP_DDMI_TEMP_LSB					(0x81)

#define SFP_DDMI_VCC_MSB					(0x82)
#define SFP_DDMI_VCC_LSB					(0x83)

#define SFP_DDMI_IBIAS0_MSB					(0x84)
#define SFP_DDMI_IBIAS0_LSB					(0x85)

#define SFP_DDMI_RXPOWER0_MSB				(0x86)
#define SFP_DDMI_RXPOWER0_LSB				(0x87)

#define SFP_DDMI_TXPOWER0_MSB				(0x88)
#define SFP_DDMI_TXPOWER0_LSB				(0x89)

#define SFP_CUR_BIAS0_MSB					(0x8A)
#define SFP_CUR_BIAS0_LSB					(0x8B)

#define SFP_CUR_MOD0_MSB					(0x8C)
#define SFP_CUR_MOD0_LSB					(0x8D)

#define SFP_CUR_CROSSING0_MSB				(0x8E)
#define SFP_CUR_CROSSING0_LSB				(0x8F)

#define SFP_DDMI_IBIAS1_MSB					(0x90)
#define SFP_DDMI_IBIAS1_LSB					(0x91)

#define SFP_DDMI_RXPOWER1_MSB				(0x92)
#define SFP_DDMI_RXPOWER1_LSB				(0x93)

#define SFP_DDMI_TXPOWER1_MSB				(0x94)
#define SFP_DDMI_TXPOWER1_LSB				(0x95)

#define SFP_CUR_BIAS1_MSB					(0x96)
#define SFP_CUR_BIAS1_LSB					(0x97)

#define SFP_CUR_MOD1_MSB					(0x98)
#define SFP_CUR_MOD1_LSB					(0x99)

#define SFP_CUR_CROSSING1_MSB				(0x9A)
#define SFP_CUR_CROSSING1_LSB				(0x9B)

#define SFP_DDMI_IBIAS2_MSB					(0x9C)
#define SFP_DDMI_IBIAS2_LSB					(0x9D)

#define SFP_DDMI_RXPOWER2_MSB				(0x9E)
#define SFP_DDMI_RXPOWER2_LSB				(0x9F)

#define SFP_DDMI_TXPOWER2_MSB				(0xA0)
#define SFP_DDMI_TXPOWER2_LSB				(0xA1)

#define SFP_CUR_BIAS2_MSB					(0xA2)
#define SFP_CUR_BIAS2_LSB					(0xA3)

#define SFP_CUR_MOD2_MSB					(0xA4)
#define SFP_CUR_MOD2_LSB					(0xA5)

#define SFP_CUR_CROSSING2_MSB				(0xA6)
#define SFP_CUR_CROSSING2_LSB				(0xA7)

#define SFP_DDMI_IBIAS3_MSB					(0xA8)
#define SFP_DDMI_IBIAS3_LSB					(0xA9)

#define SFP_DDMI_RXPOWER3_MSB				(0xAA)
#define SFP_DDMI_RXPOWER3_LSB				(0xAB)

#define SFP_DDMI_TXPOWER3_MSB				(0xAC)
#define SFP_DDMI_TXPOWER3_LSB				(0xAD)

#define SFP_CUR_BIAS3_MSB					(0xAE)
#define SFP_CUR_BIAS3_LSB					(0xAF)

#define SFP_CUR_MOD3_MSB					(0xB0)
#define SFP_CUR_MOD3_LSB					(0xB1)

#define SFP_CUR_CROSSING3_MSB				(0xB2)
#define SFP_CUR_CROSSING3_LSB				(0xB3)

#define SFP_PIN_STATUS						(0xB4)

#define MSA_PAGE4_TEC_TEMP_READBACK_MSB		(0xb5)
#define MSA_PAGE4_TEC_TEMP_READBACK_LSB		(0xb6)

#define MSA_PAGE4_TEC_TEMP_SET_MSB			(0xb7)
#define MSA_PAGE4_TEC_TEMP_SET_LSB			(0xb8)

#define MSA_PAGE4_ITEC_MSB					(0xb9)
#define MSA_PAGE4_ITEC_LSB					(0xba)

#define MSA_PAGE4_VTEC_MSB					(0xbb)
#define MSA_PAGE4_VTEC_LSB					(0xbc)

#define SFP_MOD_BOOT_REASON				    (0xBD)

#define SFP_JUMP_TO_BOOT					(0xDA)
#define SFP_DBG_CMD							(0xDB)
		#define SFP_DBG_CMD_IDLE 	(0xF2)
#define SFP_DBG_CMD_STATUS					(0xDC)
#define SFP_DBG_CMD_I2C_DEV_ADDR			(0xDD)
#define SFP_DBG_CMD_OFFSET_ADDR_LSB			(0xDE)
#define SFP_DBG_CMD_OFFSET_ADDR_MSB			(0xDF)

#define SFP_DBG_READ_DATA0					(0xE0)
#define SFP_DBG_READ_DATA1					(0xE1)
#define SFP_DBG_READ_DATA2					(0xE2)
#define SFP_DBG_READ_DATA3					(0xE3)
#define SFP_DBG_READ_DATA4					(0xE4)
#define SFP_DBG_READ_DATA5					(0xE5)
#define SFP_DBG_READ_DATA6					(0xE6)
#define SFP_DBG_READ_DATA7					(0xE7)
#define SFP_DBG_READ_DATA8					(0xE8)
#define SFP_DBG_READ_DATA9					(0xE9)
#define SFP_DBG_READ_DATA10					(0xEA)
#define SFP_DBG_READ_DATA11					(0xEB)
#define SFP_DBG_READ_DATA12					(0xEC)
#define SFP_DBG_READ_DATA13					(0xED)
#define SFP_DBG_READ_DATA14					(0xEE)
#define SFP_DBG_READ_DATA15					(0xEF)

#define SFP_MOD_SECUR_LEVEL_STATUS			(0xF0)
#define SFP_DDMI_ENABLE						(0xF1)
#define SFP_AUTO_ENABLE						(0xF2)
#define SFP_MOD_REA_SEC						(0xF3)
#define SFP_MOD_REA_MIN						(0xF4)
#define SFP_MOD_REA_HOUR					(0xF5)
#define SFP_MOD_REA_DAY						(0xF6)
#define SFP_MOD_REA_MON						(0xF7)
#define SFP_MOD_REA_YEAR				    (0xF8)
#define SFP_MOD_REA_VERSION					(0xF9)
#define SFP_MOD_TYPE						(0xFA)
#define SFP_BOOT_STATUS						(0xFB)


/**************************************************MSA Page5 Address Define***************************/
#define MSA_VENDOR_PN					(0xA8)
#define MSA_VENDOR_PN_LEN				(16)
#define MSA_VENDOR_REV					(0xB8)
#define MSA_VENDOR_REV_LEN				(2)
#define MSA_VENDOR_SN					(0xC4)
#define MSA_VENDOR_SN_LEN				(16)
#define MSA_DATA_CODE					(0xD4)
#define MSA_DATA_CODE_LEN				(8)
#define MSA_MODULE_CLASS				(0XDE)
#define MSA_OFF_MODULE_TYPE				(0x80)
#define MSA_OFF_MODULE_SUB_TYPE			(0x81)
#define MSA_OFF_HW_VER					(0x82)
#define PCBA_CODE						(0x83)  //length = 16byte
#define PCBA_CODE_LEN					(16)
#define LASER_TX_SN						(0x93)  //length = 16byte
#define LASER_TX_SN_LEN					(16)
#define LASER_RX_SN						(0xA3)  //length = 16byte
#define LASER_RX_SN_LEN					(16)
#define PCBA_SN							(0xB3)  //length = 12byte
#define PCBA_SN_LEN						(16)
#define SUPERCODE						(0xC3)  //length = 9 byte
#define SUPERCODE_LEN					(9)
#define PICCODE							(0xCC)  //length = 17 byte
#define PICCODE_LEN						(18)
#define EEP_DATA_SIZE					(0xE1)

