paddy2008/c51_uboot/inc/Efm8lb12_qsfp28.h
/**************************************************MSA Page6 Address Define***************************/

/***********Lut Tab Low Temp**************/

#define LUT_LT_TEMP_MSB			(0x80)
#define LUT_LT_TEMP_LSB			(0x81)

#define LUT_LT_VCC_MSB			(0x82)
#define LUT_LT_VCC_LSB			(0x83)

#define LUT_LT_IBIAS0_MSB		(0x84)
#define LUT_LT_IBIAS0_LSB		(0x85)

#define LUT_LT_RXPOWER0_MSB		(0x86)
#define LUT_LT_RXPOWER0_LSB		(0x87)

#define LUT_LT_TXPOWER0_MSB		(0x88)
#define LUT_LT_TXPOWER0_LSB		(0x89)

#define LUT_LT_BIAS0_MSB		(0x8A)
#define LUT_LT_BIAS0_LSB		(0x8B)

#define LUT_LT_MOD0_MSB			(0x8C)
#define LUT_LT_MOD0_LSB			(0x8D)

#define LUT_LT_CROSSING0_MSB	(0x8E)
#define LUT_LT_CROSSING0_LSB	(0x8F)

#define LUT_LT_IBIAS1_MSB		(0x90)
#define LUT_LT_IBIAS1_LSB		(0x91)

#define LUT_LT_RXPOWER1_MSB		(0x92)
#define LUT_LT_RXPOWER1_LSB		(0x93)

#define LUT_LT_TXPOWER1_MSB		(0x94)
#define LUT_LT_TXPOWER1_LSB		(0x95)

#define LUT_LT_BIAS1_MSB		(0x96)
#define LUT_LT_BIAS1_LSB		(0x97)

#define LUT_LT_MOD1_MSB			(0x98)
#define LUT_LT_MOD1_LSB			(0x99)

#define LUT_LT_CROSSING1_MSB	(0x9A)
#define LUT_LT_CROSSING1_LSB	(0x9B)

#define LUT_LT_IBIAS2_MSB		(0x9C)
#define LUT_LT_IBIAS2_LSB		(0x9D)

#define LUT_LT_RXPOWER2_MSB		(0x9E)
#define LUT_LT_RXPOWER2_LSB		(0x9F)

#define LUT_LT_TXPOWER2_MSB		(0xA0)
#define LUT_LT_TXPOWER2_LSB		(0xA1)

#define LUT_LT_BIAS2_MSB		(0xA2)
#define LUT_LT_BIAS2_LSB		(0xA3)

#define LUT_LT_MOD2_MSB			(0xA4)
#define LUT_LT_MOD2_LSB			(0xA5)

#define LUT_LT_CROSSING2_MSB	(0xA6)
#define LUT_LT_CROSSING2_LSB	(0xA7)

#define LUT_LT_IBIAS3_MSB		(0xA8)
#define LUT_LT_IBIAS3_LSB		(0xA9)

#define LUT_LT_RXPOWER3_MSB		(0xAA)
#define LUT_LT_RXPOWER3_LSB		(0xAB)

#define LUT_LT_TXPOWER3_MSB		(0xAC)
#define LUT_LT_TXPOWER3_LSB		(0xAD)

#define LUT_LT_BIAS3_MSB		(0xAE)
#define LUT_LT_BIAS3_LSB		(0xAF)

#define LUT_LT_MOD3_MSB			(0xB0)
#define LUT_LT_MOD3_LSB			(0xB1)

#define LUT_LT_CROSSING3_MSB	(0xB2)
#define LUT_LT_CROSSING3_LSB	(0xB3)

/***********Lut Tab Middle Temp**************/

#define LUT_MT_TEMP_MSB			(0xB4)
#define LUT_MT_TEMP_LSB			(0xB5)

#define LUT_MT_VCC_MSB			(0xB6)
#define LUT_MT_VCC_LSB			(0xB7)

#define LUT_MT_IBIAS0_MSB		(0xB8)
#define LUT_MT_IBIAS0_LSB		(0xB9)

#define LUT_MT_RXPOWER0_MSB		(0xBA)
#define LUT_MT_RXPOWER0_LSB		(0xBB)

#define LUT_MT_TXPOWER0_MSB		(0xBC)
#define LUT_MT_TXPOWER0_LSB		(0xBD)

#define LUT_MT_BIAS0_MSB		(0xBE)
#define LUT_MT_BIAS0_LSB		(0xBF)

#define LUT_MT_MOD0_MSB			(0xC0)
#define LUT_MT_MOD0_LSB			(0xC1)

#define LUT_MT_CROSSING0_MSB	(0xC2)
#define LUT_MT_CROSSING0_LSB	(0xC3)

#define LUT_MT_IBIAS1_MSB		(0xC4)
#define LUT_MT_IBIAS1_LSB		(0xC5)

#define LUT_MT_RXPOWER1_MSB		(0xC6)
#define LUT_MT_RXPOWER1_LSB		(0xC7)

#define LUT_MT_TXPOWER1_MSB		(0xC8)
#define LUT_MT_TXPOWER1_LSB		(0xC9)

#define LUT_MT_BIAS1_MSB		(0xCA)
#define LUT_MT_BIAS1_LSB		(0xCB)

#define LUT_MT_MOD1_MSB			(0xCC)
#define LUT_MT_MOD1_LSB			(0xCD)

#define LUT_MT_CROSSING1_MSB	(0xCE)
#define LUT_MT_CROSSING1_LSB	(0xCF)

#define LUT_MT_IBIAS2_MSB		(0xD0)
#define LUT_MT_IBIAS2_LSB		(0xD1)

#define LUT_MT_RXPOWER2_MSB		(0xD2)
#define LUT_MT_RXPOWER2_LSB		(0xD3)

#define LUT_MT_TXPOWER2_MSB		(0xD4)
#define LUT_MT_TXPOWER2_LSB		(0xD5)

#define LUT_MT_BIAS2_MSB		(0xD6)
#define LUT_MT_BIAS2_LSB		(0xD7)

#define LUT_MT_MOD2_MSB			(0xD8)
#define LUT_MT_MOD2_LSB			(0xD9)

#define LUT_MT_CROSSING2_MSB	(0xDA)
#define LUT_MT_CROSSING2_LSB	(0xDB)

#define LUT_MT_IBIAS3_MSB		(0xDC)
#define LUT_MT_IBIAS3_LSB		(0xDD)

#define LUT_MT_RXPOWER3_MSB		(0xDE)
#define LUT_MT_RXPOWER3_LSB		(0xDF)

#define LUT_MT_TXPOWER3_MSB		(0xE0)
#define LUT_MT_TXPOWER3_LSB		(0xE1)

#define LUT_MT_BIAS3_MSB		(0xE2)
#define LUT_MT_BIAS3_LSB		(0xE3)

#define LUT_MT_MOD3_MSB			(0xE4)
#define LUT_MT_MOD3_LSB			(0xE5)

#define LUT_MT_CROSSING3_MSB	(0xE6)
#define LUT_MT_CROSSING3_LSB	(0xE7)

/**************************************************MSA Page7 Address Define***************************/

/***********Lut Tab High Temp**************/
#define LUT_HT_TEMP_MSB			(0x80)
#define LUT_HT_TEMP_LSB			(0x81)

#define LUT_HT_VCC_MSB			(0x82)
#define LUT_HT_VCC_LSB			(0x83)

#define LUT_HT_IBIAS0_MSB		(0x84)
#define LUT_HT_IBIAS0_LSB		(0x85)

#define LUT_HT_RXPOWER0_MSB		(0x86)
#define LUT_HT_RXPOWER0_LSB		(0x87)

#define LUT_HT_TXPOWER0_MSB		(0x88)
#define LUT_HT_TXPOWER0_LSB		(0x89)

#define LUT_HT_BIAS0_MSB		(0x8A)
#define LUT_HT_BIAS0_LSB		(0x8B)

#define LUT_HT_MOD0_MSB			(0x8C)
#define LUT_HT_MOD0_LSB			(0x8D)

#define LUT_HT_CROSSING0_MSB	(0x8E)
#define LUT_HT_CROSSING0_LSB	(0x8F)

#define LUT_HT_IBIAS1_MSB		(0x90)
#define LUT_HT_IBIAS1_LSB		(0x91)

#define LUT_HT_RXPOWER1_MSB		(0x92)
#define LUT_HT_RXPOWER1_LSB		(0x93)

#define LUT_HT_TXPOWER1_MSB		(0x94)
#define LUT_HT_TXPOWER1_LSB		(0x95)

#define LUT_HT_BIAS1_MSB		(0x96)
#define LUT_HT_BIAS1_LSB		(0x97)

#define LUT_HT_MOD1_MSB			(0x98)
#define LUT_HT_MOD1_LSB			(0x99)

#define LUT_HT_CROSSING1_MSB	(0x9A)
#define LUT_HT_CROSSING1_LSB	(0x9B)

#define LUT_HT_IBIAS2_MSB		(0x9C)
#define LUT_HT_IBIAS2_LSB		(0x9D)

#define LUT_HT_RXPOWER2_MSB		(0x9E)
#define LUT_HT_RXPOWER2_LSB		(0x9F)

#define LUT_HT_TXPOWER2_MSB		(0xA0)
#define LUT_HT_TXPOWER2_LSB		(0xA1)

#define LUT_HT_BIAS2_MSB		(0xA2)
#define LUT_HT_BIAS2_LSB		(0xA3)

#define LUT_HT_MOD2_MSB			(0xA4)
#define LUT_HT_MOD2_LSB			(0xA5)

#define LUT_HT_CROSSING2_MSB	(0xA6)
#define LUT_HT_CROSSING2_LSB	(0xA7)

#define LUT_HT_IBIAS3_MSB		(0xA8)
#define LUT_HT_IBIAS3_LSB		(0xA9)

#define LUT_HT_RXPOWER3_MSB		(0xAA)
#define LUT_HT_RXPOWER3_LSB		(0xAB)

#define LUT_HT_TXPOWER3_MSB		(0xAC)
#define LUT_HT_TXPOWER3_LSB		(0xAD)

#define LUT_HT_BIAS3_MSB		(0xAE)
#define LUT_HT_BIAS3_LSB		(0xAF)

#define LUT_HT_MOD3_MSB			(0xB0)
#define LUT_HT_MOD3_LSB			(0xB1)

#define LUT_HT_CROSSING3_MSB	(0xB2)
#define LUT_HT_CROSSING3_LSB	(0xB3)

