paddy2008/c51_uboot/inc/Efm8lb12_qsfp28.h
#define TEC_TARGET_MSB			(0xFE)
#define TEC_TARGET_LSB			(0xFF)


/**************************************************MSA Page8 Address Define***************************/
#define RX_LOS_MODE				(0x80)
#define RX_LOSA_THLD_CH0_MSB	(0x81)
#define RX_LOSA_THLD_CH0_LSB	(0x82)
#define RX_LOSD_THLD_CH0_MSB	(0x83)
#define RX_LOSD_THLD_CH0_LSB	(0x84)
#define RX_LOSA_THLD_CH1_MSB	(0x85)
#define RX_LOSA_THLD_CH1_LSB	(0x86)
#define RX_LOSD_THLD_CH1_MSB	(0x87)
#define RX_LOSD_THLD_CH1_LSB	(0x88)
#define RX_LOSA_THLD_CH2_MSB	(0x89)
#define RX_LOSA_THLD_CH2_LSB	(0x8A)
#define RX_LOSD_THLD_CH2_MSB	(0x8B)
#define RX_LOSD_THLD_CH2_LSB	(0x8C)
#define RX_LOSA_THLD_CH3_MSB	(0x8D)
#define RX_LOSA_THLD_CH3_LSB	(0x8E)
#define RX_LOSD_THLD_CH3_MSB	(0x8F)
#define RX_LOSD_THLD_CH3_LSB	(0x90)
#define RSSI_DRAKA_THLD_CH0_MSB	(0x91)
#define RSSI_DRAKA_THLD_CH0_LSB	(0x92)
#define RSSI_DRAKD_THLD_CH0_MSB	(0x93)
#define RSSI_DRAKD_THLD_CH0_LSB	(0x94)
#define RSSI_DRAKA_THLD_CH1_MSB	(0x95)
#define RSSI_DRAKA_THLD_CH1_LSB	(0x96)
#define RSSI_DRAKD_THLD_CH1_MSB	(0x97)
#define RSSI_DRAKD_THLD_CH1_LSB	(0x98)
#define RSSI_DRAKA_THLD_CH2_MSB	(0x99)
#define RSSI_DRAKA_THLD_CH2_LSB	(0x9A)
#define RSSI_DRAKD_THLD_CH2_MSB	(0x9B)
#define RSSI_DRAKD_THLD_CH2_LSB	(0x9C)
#define RSSI_DRAKA_THLD_CH3_MSB	(0x9D)
#define RSSI_DRAKA_THLD_CH3_LSB	(0x9E)
#define RSSI_DRAKD_THLD_CH3_MSB	(0x9F)
#define RSSI_DRAKD_THLD_CH3_LSB	(0xA0)


/***********Ddmi cali para save**************/
//MSA page6

#define PAGE6_DDMI_CALI_TEMP_OFFSET_MSB			(0xE8)
#define PAGE6_DDMI_CALI_TEMP_OFFSET_LSB			(0xE9)

#define PAGE6_DDMI_CALI_VCC_OFFSET_MSB			(0xEA)
#define PAGE6_DDMI_CALI_VCC_OFFSET_LSB			(0xEB)

#define PAGE6_DDMI_CALI_CH0_BIAS_BASE_ADDR  	(0xEC)
#define PAGE6_DDMI_CALI_CH0_TXPOWER_BASE_ADDR  	(0xF8)
#define PAGE6_DDMI_CALI_CH0_RXPOWER_BASE_ADDR  	(0xF0)

//MSA page7
#define PAGE7_DDMI_CALI_CH1_BIAS_BASE_ADDR  	(0xB4)
#define PAGE7_DDMI_CALI_CH1_TXPOWER_BASE_ADDR  	(0xC0)
#define PAGE7_DDMI_CALI_CH1_RXPOWER_BASE_ADDR  	(0xB8)

#define PAGE7_DDMI_CALI_CH2_BIAS_BASE_ADDR  	(0xC8)
#define PAGE7_DDMI_CALI_CH2_TXPOWER_BASE_ADDR  	(0xD4)
#define PAGE7_DDMI_CALI_CH2_RXPOWER_BASE_ADDR  	(0xCC)

#define PAGE7_DDMI_CALI_CH3_BIAS_BASE_ADDR  	(0xDC)
#define PAGE7_DDMI_CALI_CH3_TXPOWER_BASE_ADDR  	(0xE8)
#define PAGE7_DDMI_CALI_CH3_RXPOWER_BASE_ADDR  	(0xE0)

#define PAGE6_LT_CH0_LASER_CFG_BASE_ADDR (0x8A)
#define PAGE6_LT_CH1_LASER_CFG_BASE_ADDR (0x96)
#define PAGE6_LT_CH2_LASER_CFG_BASE_ADDR (0xA2)
#define PAGE6_LT_CH3_LASER_CFG_BASE_ADDR (0xAE)

#define PAGE6_MT_CH0_LASER_CFG_BASE_ADDR (0xBE)
#define PAGE6_MT_CH1_LASER_CFG_BASE_ADDR (0xCA)
#define PAGE6_MT_CH2_LASER_CFG_BASE_ADDR (0xD6)
#define PAGE6_MT_CH3_LASER_CFG_BASE_ADDR (0xE2)

#define PAGE7_HT_CH0_LASER_CFG_BASE_ADDR (0x8A)
#define PAGE7_HT_CH1_LASER_CFG_BASE_ADDR (0x96)
#define PAGE7_HT_CH2_LASER_CFG_BASE_ADDR (0xA2)
#define PAGE7_HT_CH3_LASER_CFG_BASE_ADDR (0xAE)

/*
#define DDMI_CALI_CH0_BIAS1_OFFSET_MSB		(0xEC)
#define DDMI_CALI_CH0_BIAS1_OFFSET_LSB		(0xED)

#define DDMI_CALI_CH0_BIAS2_OFFSET_MSB		(0xEE)
#define DDMI_CALI_CH0_BIAS2_OFFSET_LSB		(0xEF)

#define DDMI_CALI_CH0_RXPOWR1_OFFSET_MSB	(0xF0)
#define DDMI_CALI_CH0_RXPOWR1_OFFSET_LSB	(0xF1)

#define DDMI_CALI_CH0_RSSI1_OFFSET_MSB		(0xF2)
#define DDMI_CALI_CH0_RSSI1_OFFSET_LSB		(0xF3)

#define DDMI_CALI_CH0_RXPOWR2_OFFSET_MSB	(0xF4)
#define DDMI_CALI_CH0_RXPOWR2_OFFSET_LSB	(0xF5)

#define DDMI_CALI_CH0_RSSI2_OFFSET_MSB		(0xF6)
#define DDMI_CALI_CH0_RSSI2_OFFSET_LSB		(0xF7)

#define DDMI_CALI_CH0_TXPOWR1_OFFSET_MSB	(0xF8)
#define DDMI_CALI_CH0_TXPOWR1_OFFSET_LSB	(0xF9)

#define DDMI_CALI_CH0_TXMON1_OFFSET_MSB		(0xFA)
#define DDMI_CALI_CH0_TXMON1_OFFSET_LSB		(0xFB)

#define DDMI_CALI_CH0_TXPOWR2_OFFSET_MSB	(0xFC)
#define DDMI_CALI_CH0_TXPOWR2_OFFSET_LSB	(0xFD)

#define DDMI_CALI_CH0_TXMON2_OFFSET_MSB		(0xFE)
#define DDMI_CALI_CH0_TXMON2_OFFSET_LSB		(0xFF)

*/

//MSA page7

/**************************************************MSA Page10 Address Define***************************/
#define PAGE10_START_ADDR 		(0x80)

typedef enum
{
	DDMI_CALI_BEFORE  = 0x0,
	DDMI_CALI_AFTER   = 0x1,
}DDMI_CALI_TYPE;

typedef enum
{
	TXCDR_TX 			= 0x0,
	TXCDR_BISA_DAC  	= 0x1,  //SR4 101, LR4 301, CWDM4-206,CWDM4-202
	TXCDR_IBIAS			= 0x2,
	TXCDR_MOD_DAC  		= 0x3,  //SR4 101, LR4 301, CWDM4-206,CWDM4-202
	TXCDR_IMOD			= 0x4,
	TXCDR_CROSS_DAC  	= 0x5,  //SR4 101, LR4 301, CWDM4-206,CWDM4-202
	TXCDR_CROSS		  	= 0x6,
	TXCDR_SLEW			= 0x7,
	TXCDR_PREFALL		= 0x8,
	TXCDR_TDE			= 0x9,
	TXCDR_LASER			= 0xA,
	RXCDR_DEEM			= 0xB,
	RXCDR_SLA_EN		= 0xC,
	RXCDR_AGC			= 0xD,
	RXCDR_SLICE			= 0xE,
	RXCDR_RSSI_ADC		= 0xF,
	TXCDR_EQ			= 0x10,//SR 101, LR4 301
	POWER_ADJUST		= 0x11, //CWDM4-202
	TXCDR_TEMP			= 0x12, //CWDM4-202
	TXCDR_VCC			= 0x13, //CWDM4-202
	TXCDR_HFDE			= 0x14, //CWDM4-202
	TXCDR_LFDE			= 0x15, //CWDM4-202
	TXCDR_ASY			= 0x16, //CWDM4-202
	TXCDR_IBIASMOD		= 0x17,
}CDR_REG;

typedef enum
{
	DBG_READ_CMD            = 1,
	DBG_WRITE_CMD           = 2,
	DBG_DEBUG_LOG_CMD       = 4,
	DBG_AUTO_ENABLE_CMD		= 5,
	DBG_AUTO_DISABLE_CMD	= 6,
	DBG_APC_CALI_CMD        = 7,
	DBG_JUMP_TO_BOOT_CMD	= 9,

	DBG_DDMI_ENABLE_CMD		= 0xa,
	DBG_DDMI_DISABLE_CMD	= 0xb,
	DBG_RESET_CMD			= 0xc,
	DBG_EEP_INIT_CMD		= 0xd,
	DBG_SAVE_REG_TO_EEP_CMD	= 0xe,
	DBG_SET_CUR_LUT_CMD		= 0xf,
	DBG_SET_MOD_CONSOLE		= 0x10,
	DBG_TEC_ENABLE_CMD		= 0x11,
	DBG_LASER_ON_CMD		= 0x12,
	DBG_LASER_OFF_CMD		= 0x13,
	DBG_FACTORY_RESET_CMD	= 0x14,
	DBG_AGING_START_CMD		= 0x15,
	DBG_AGING_STOP_CMD		= 0x16,
	DBG_AGING_EEP_INIT_CMD	= 0x17,
	DBG_BONDING_MODE		= 0x18,
	DBG_I2C_TXCDR_ENABLE	= 0x19,
	DBG_I2C_RXCDR_ENABLE	= 0x1A,
	DBG_EEP_ERASE_CMD		= 0x1B,
	DBG_UNKNOW_CMD			= 0xFF,
}MSA_PAGE4_DBG_CMD_T;

typedef enum
{
	FSR_TEST_BOARD_TYPE_LR4        = 0,
	FSR_TEST_BOARD_TYPE_AOC_M      = 1,
	FSR_TEST_BOARD_TYPE_AOC_S      = 2,
	FSR_TEST_BOARD_TYPE_CWDM4_202  = 3,
	FSR_TEST_BOARD_UNKNOW_TYPE	   	  ,
}TEST_BOARD_WORK_TYPE;

