paddy2008/c51_uboot/inc/Efm8lb12_qsfp28.h
typedef enum
{
	DISABLE_LOG_CMD	= 0x0,
	ENABLE_LOG_CMD	= 0x1,
	READ_LOG_CMD	= 0x2,
	CLEAR_LOG_CMD	= 0xc,
}DEBUG_LOG_ACTION;

typedef enum
{
	SAVE_CUR_LT_LUT_TAB  = 0x1,
	SAVE_CUR_MT_LUT_TAB  = 0x2,
	SAVE_CUR_HT_LUT_TAB  = 0x3,
}SAVE_CUR_LUT_TAB;

typedef enum
{
	DDMI_VCC 	 = 0x0,
	DDMI_TEMP	 = 0x1,
	DDMI_BIAS	 = 0x2,
	DDMI_TXMON	 = 0x3,
	DDMI_RSSI	 = 0x4,
}DDMI_DATA_TYPE;

typedef enum
{
  MODULE_TYPE_SR4		= 0x1,
  MODULE_TYPE_CWDM4		= 0x2,
  MODULE_TYPE_LR4		= 0x3,
}MODULE_TYPE;

typedef enum
{
	EEP_INIT  = 0x1,
	EEP_SAVE  = 0x2,
	EEP_SHOW  = 0x3,
	EEP_ERASE = 0x4,
	EEP_UNKNOW    ,
}EEP_ACTION;

typedef struct
{
	uint8_t  devAddr;
	uint8_t  value;
	uint16_t offsetAddr;
}SAVE_REG_T;

typedef struct
{
	uint8_t sec;
	uint8_t min;
	uint8_t hour;
	uint8_t day;
	uint8_t mon;
	uint8_t year;
	uint8_t ver_num_msb;
	uint8_t ver_num_lsb;
}MODULE_REALEASE_INFO;

typedef struct
{
	uint8_t msb;
	uint8_t lsb;
}DATA_UNIT;


typedef struct {
	int16_t 		temp;
	uint16_t		bias;
	uint16_t		mod;
	int16_t			cross;
}MSA_LASER_CH_CFG_T;

typedef struct {
	uint16_t		bias;
	uint16_t		mod;
	int16_t			cross;
}LASER_CFG_T;

typedef enum {
	MSA_LUT_TYPE_LOW_TEMP	= 0,
	MSA_LUT_TYPE_MID_TEMP	= 1,
	MSA_LUT_TYPE_HI_TEMP	= 2,
	MSA_LUT_TYPE_MAX		= 3,
}MSA_LUT_TYPE;


typedef enum
{
	CHANNEL0  		= 0,
	CHANNEL1  		= 1,
	CHANNEL2  		= 2,
	CHANNEL3  		= 3,
	CHANNEL_MAX  	= 4,
}CHANNEL_NUM;

typedef enum
{
	ACTION_ENABLE 	  = 0,
	ACTION_DISABLE	  = 1,
	ACTION_I2C_READ   = 2,
	ACTION_I2C_WRITE  = 3,
}I2C_ACTION;


typedef enum {
	MSA_PAGE_LOWER	= 0xfe,
	MSA_PAGE_00H	= 0x0,
	MSA_PAGE_01H	= 0x1,
	MSA_PAGE_02H	= 0x2,
	MSA_PAGE_03H	= 0x3,
	SFP_PAGE_04H	= 0x4,
	SFP_PAGE_05H    = 0x5,
	SFP_PAGE_06H    = 0x6,
	SFP_PAGE_07H    = 0x7,
	SFP_PAGE_08H    = 0x8,
	SFP_PAGE_09H    = 0x9,
	SFP_PAGE_0AH    = 0xa,
	SFP_NONE_PAGE	= 0xb,
}SFP_PAGE;

/*MSA Lower Page Define*/
typedef struct
{
	int16_t  temp;  	//byte 22, 23
	uint8_t  resv0[2];  //byte 24, 25
	uint16_t vcc;		//byte 26, 27
	uint8_t  resv1[6];  //byte 28, 29, 30, 31, 32, 33
	uint16_t rssi[MAX_CHANNEL_NUMS];  	 //byte 34,35,36,37,38,39,40,41
	uint16_t txbias[MAX_CHANNEL_NUMS];	 //byte 42,43,44,45,46,47,48,49
	uint16_t txpower[MAX_CHANNEL_NUMS];  //byte 50,51,52,53,54,55,56,57
}MSA_PAGE_LOWER_MON_T;

#define MSA_PAGE_LOWER_MON_BASE_ADDR	(22)

/*Ddmi cali parameter*/
typedef struct {
	uint16_t txpower1;
	uint16_t bias1;
	uint16_t txpower2;
	uint16_t bias2;
}TXPOWER_CALI_PARA_T;

typedef struct {
	uint16_t rxpower1;
	uint16_t rssi1;
	uint16_t rxpower2;
	uint16_t rssi2;
}RXPOWER_CALI_PARA_T;

typedef struct{
	uint16_t bias_offset1;  // in 0.1mA
	uint16_t bias_offset2;
}BIAS_CALI_PARA_T;

typedef struct {
	BIAS_CALI_PARA_T	bias;
	RXPOWER_CALI_PARA_T	rxpower;
	TXPOWER_CALI_PARA_T	txpower;
}CURRENT_CALI_PARA_T;

typedef struct {
	int16_t temp;	// in 1/256 C
	int16_t vcc;	// in 0.1mV
	CURRENT_CALI_PARA_T current[MAX_CHANNEL_NUMS];
}DDMI_CALI_PARA_T;

typedef enum {
	TEMP_HIGH_ALARM		= 0x0,
	TEMP_LOW_ALARM		= 0x1,
	TEMP_HIGH_WARN		= 0x2,
	TEMP_LOW_WARN  	    = 0x3,
	VCC_HIGH_ALARM      = 0x4,
	VCC_LOW_ALARM	    = 0x5,
	VCC_HIGH_WARN	    = 0x6,
	VCC_LOW_WARN	    = 0x7,
	RXPWR_HIGH_ALARM	= 0x8,
	RXPWR_LOW_ALARM	    = 0x9,
	RXPWR_HIGH_WARN 	= 0xa,
	RXPWR_LOW_WARN      = 0xb,
	TXBIAS_HIGH_ALARM	= 0xc,
	TXBIAS_LOW_ALARM	= 0xd,
	TXBIAS_HIGH_WARN	= 0xe,
	TXBIAS_LOW_WARN     = 0xf,
	TXPWR_HIGH_ALARM	= 0x10,
	TXPWR_LOW_ALARM	    = 0x11,
	TXPWR_HIGH_WARN	    = 0x12,
	TXPWR_LOW_WARN      = 0x13,
	HTRHLD_ALL   		= 0x14,
	UNKNOW_ALARM		= 0xFF,
}MSA_PAGE3_ALARM_WARING_THRESHOLD_T;

typedef enum
{
	PART_LUT_INFO = 0x0,
	ALL_LUT_INFO  = 0x1,
}LUT_SHOW_TYPE;

typedef struct
{
	uint8_t ddmi_enable;
	uint8_t auto_enable;
}POLL_T;


void     com_delay(uint16_t i);
void 	 com_delay_us(uint8_t us);
int16_t  com_str_to_int16(uint8_t *str);
bool 	 com_get_module_boot_status();
uint8_t _qsfp28_get_channel(const char  *s);
uint16_t com_average_value16(uint16_t *buffer, uint8_t length);
uint8_t	qsfp28_get_mod_release_info();
uint32_t qsfp28_get_mod_soft_type();
uint8_t qsfp28_get_mod_type();
uint8_t qsfp28_get_ddmi(DDMI_DATA_TYPE ddmi_type, uint8_t channel, DDMI_CALI_TYPE type);
uint8_t qsfp28_get_cur_apc_value(uint8_t channel);
uint8_t qsfp28_get_fixed_temp_point_apc_value(int8_t temp, uint8_t channel);
uint8_t	qsfp28_set_lut_tab_para_from_reg_inner(uint8_t channel, SAVE_CUR_LUT_TAB cur_lut);
uint8_t qsfp28_dbg_i2c_write_byte(uint16_t offset_addr,uint8_t value);
uint8_t qsfp28_set_cur_apc_value(uint8_t channel);
uint8_t qsfp28_set_fixed_temp_point_apc_value(int8_t temp, uint8_t channel);
uint8_t qsfp28_dbg_i2c_read(uint8_t dev_addr, uint16_t offset_addr, uint8_t *value, uint8_t len);
uint8_t qsfp28_dbg_i2c_write(uint8_t dev_addr, uint8_t page, uint16_t offset_addr, uint8_t *value, uint8_t len);
uint8_t qsfp28_debug_log_handle(DEBUG_LOG_ACTION action);
uint8_t	qsfp28_eep_handle(EEP_ACTION action, uint8_t dev_addr, uint16_t offset_addr, uint8_t value);
uint8_t qsfp28_get_msa_lower_page_monitor();
uint8_t qsfp28_set_ddmi_cali_para(DDMI_DATA_TYPE ddmi_type, uint8_t channel, DDMI_CALI_PARA_T* cali_para);
uint8_t qsfp28_get_ddmi_cali_para(DDMI_DATA_TYPE ddmi_type, uint8_t channel, DDMI_CALI_PARA_T* cali_para);
uint8_t qsfp28_get_tec(SFP_PAGE page,uint8_t tec,uint16_t *Pdata);
uint8_t qsfp28_set_tec(SFP_PAGE page,uint8_t tec,uint16_t *Pdata);
uint8_t qsfp28_config_mod_console(bool enable);
uint8_t qsfp28_set_thrhld_value(MSA_PAGE3_ALARM_WARING_THRESHOLD_T type,uint16_t value);
uint8_t qsfp28_get_thrhld_value(MSA_PAGE3_ALARM_WARING_THRESHOLD_T type);
uint8_t qsfp28_msa_page4_dbg_cmd(MSA_PAGE4_DBG_CMD_T cmd);
uint8_t qsfp28_set_lut_tab(uint8_t channel, MSA_LUT_TYPE type,  MSA_LASER_CH_CFG_T cfg);
uint8_t qsfp28_get_lut_tab(uint8_t channel,LUT_SHOW_TYPE show_type, MSA_LUT_TYPE type);
uint8_t qsfp28_get_module_class();
uint8_t qsfp28_set_module_class(uint8_t value);
uint8_t qsfp28_common_rssi_show();
bool qsfp28_get_cmd_status();
uint8_t qsfp28_enable_module_poll();
uint8_t qsfp28_disable_module_poll();
uint8_t qsfp28_select_page(uint8_t BaseAddr,uint16_t OffsetAddr,uint8_t page);
uint8_t   smb_write_page_byte(uint8_t BaseAddr, uint8_t page, uint16_t OffsetAddr,uint8_t *Data, uint16_t Length);
uint8_t   smb_read_page_byte(uint8_t BaseAddr, uint8_t page, uint16_t OffsetAddr,uint8_t *Data, uint16_t Length);

#endif
